app/Controllers/RegistrarController.php

    public function guardar()
    {
        // Valida los datos del formulario
        $validation = \Config\Services::validation();
        $validation->setRules([
            'nombre'      => 'required|min_length[3]|max_length[50]',
            'apellido'    => 'required|min_length[3]|max_length[50]',
            'mail'        => 'required|valid_email|is_unique[usuarios.mail]',
            'contrasenia' => 'required|min_length[6]',
        ]);

        if (!$validation->withRequest($this->request)->run()) {
            // Si hay errores de validación, vuelve a la vista de registro con los errores
            return redirect()->back()->withInput()->with('validation', $validation);
        }

        // Crea una instancia del modelo de usuario
        $usuarioModel = new UserModel();

        // Datos del formulario
        $data = [
            'nombre'      => $this->request->getPost('nombre'),
            'apellido'    => $this->request->getPost('apellido'),
            'mail'        => $this->request->getPost('mail'),
            'contrasenia' => $this->request->getPost('contrasenia'), // Sin hashear la contraseña
            'tipo_usuario' => '0' // Ajusta según el valor predeterminado deseado
        ];

        // Guarda en la base de datos
        if ($usuarioModel->insert($data)) {
---
INSERT INTO `usuarios` (`nombre`, `apellido`, `mail`, `contrasenia`, `tipo_usuario`) VALUES ('angel', 'olivetti', 'angelolivetti78@gmail.com', '1234567890', '0')